#!/bin/bash
function vvod_danih {
echo "Давайка по пробуем по играться с числами, ни каких дробей и букв и всякой такой фигни, только целые числа"
echo "Давай первую длину"
read a
echo "Давай вторую не, тушуйся"
read b
echo "ну давай епта выжми из себя третий размер"
read c
echo "------------------------------------"

proverka_na_chislo

}

# --------------------------------------------------

function proverka_treugolnika {
if [[ $a = $b && $a = $c && $c = $b ]]; then

        echo "Равносторонний треугольничег вышел"

elif [[ $a = $b || $a = $c || $c = $b ]]; then

        echo "Равнобедренный треугольничег вышел"
else
        echo "Обычный треугольничег вышел"
fi
}

#---------------------------------------------------

function proverka_na_treugolnik {

if [[ $(( a + b )) -le $c || $(( c + b )) -le $a || $(( a + c )) -le $b ]]; then

        echo "ты зачем так балуешься и у нас стобой вышел не треугольничег а фиг знает что, епа мать"
        exit 1
else
  echo "красавчег могет умеешь практикуешь"
  echo "------------------------------------------"
  proverka_treugolnika
fi
}

#---------------------------------------------------

function proverka_na_chislo {

check_a=`echo "$a" | grep -E ^\-?[0-9]+$`
check_b=`echo "$b" | grep -E ^\-?[0-9]+$`
check_c=`echo "$c" | grep -E ^\-?[0-9]+$`


if [[ "$check_a" -ne '' &&  "$check_b" != ''  &&  "$check_c" != '' ]]; then
   echo "О мой бог ты смог ввести 3 цифры как я тебя и просил, респект чувак"
   echo "------------------------------------"
   proverka_na_treugolnik
else
  echo "Ты читал ваще условия ввода значений"
  exit 1
fi
}

#---------------------------------------------------

echo "------------------------------------"

vvod_danih

